// Написать программу вычисления функции y = f(a)
Console.Clear();
double F(double a)
{
    double result = a * a + 1;
    return result;
}

System.Console.WriteLine(F(6));